<template>
	<view class="advertise">
		<image src="../../static/image/素材5.jpg"/>
			<p>舌诊作为中医诊断的重要方法，在中医传统医学中占据着举足轻重的地位。</p>
			<p>舌头是人体内脏器官的一个重要反应区，通过观察舌苔、舌体的颜色、形态、湿润程度等变化，可以反映出人体脏腑气血运行和疾病变化的情况。</p>
            <p>“舌尖上的智慧，舌尖上的健康！舌诊，中医传统诊疗中的至宝，不仅是一门技术，更是一种智慧的结晶。每一次细心观察舌头的变化，就是对身体健康的呵护与关注。舌尖传递的不仅是味蕾的感受，更是身体内在状况的信号。</p>
			<p>红润的舌体，淡白的舌苔，清亮的口腔，都是健康的标志；若发现舌苔发黄、舌体胖大、口干唇燥等异常，也许是身体发出的求助信号。”</p>
			<p>“舌尖一瞥，百病无忧。舌诊，超越肌肤深层，洞察身体内在。每一处细微的变化都蕴含着健康的密码，每一次准确的判断都是对疾病的及时发现。在舌尖上探寻健康之源，让中医的智慧指引您走向健康之路。珍惜每一次舌诊的机会，珍爱自己的健康。”</p>
			<p>“舌尖，是身体的镜子；舌诊，是健康的先声。借助舌诊这一中医宝贵遗产，我们能够更加全面地了解自己的身体状况，从舌苔的厚薄、颜色、舌体的湿润度等方面找出身体的不适，及时采取有效措施。让舌尖上的信息成为我们健康的晴雨表，引领我们远离疾病的侵袭，享受健康的生活。”</p>
			<p>希望能够展现出舌诊在中医传统医学中的重要价值，引导人们关注舌头的健康状况，及时发现身体的不适，保持健康生活。</p>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				
			}
		},
		methods: {
			
		}
	}
</script>

<style>
    .advertise{
		text-indent: 32px; /* 设置文本缩进为20像素 */
	}
</style>
